{"_id":{"$oid":"63f2dba772ba79dbfad593c7"},"Title":"Tommy Boy","Description":"After the owner of an auto parts factory passes away, his relatives try to sell it and relinquish their responsibilities. Trouble ensues when his incompetent son has to save the business.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Peter Segal","Bio":"Peter Segal is an American film director, producer, screenwriter, and actor. Segal has directed the comedic films Tommy Boy, My Fellow Americans, The Nutty Professor II.","Birth":"1962"},"ImagePath":"tommyboy.png","Featured":true}
{"_id":{"$oid":"63f3fd9e72ba79dbfad593c8"},"Title":"Office Space","Description":"Peter, a software engineer, is tired of his boring job and makes a vengeful plan with two of his friends to plant a virus in his company''s system.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Mike Judge","Bio":"Mike Judge is an American actor, animator, film director, screenwriter, and television producer. Judge was born in Guayaquil, the largest city of Ecuador and the country's main port.","Birth":"1944"},"ImagePath":"officespace.png","Featured":false}
{"_id":{"$oid":"63f4022372ba79dbfad593c9"},"Title":"The Notebook","Description":"Duke reads the story of Allie and Noah, two lovers who were separated by fate, to Ms Hamilton, an old woman who suffers from dementia, on a daily basis out of his notebook.","Genre":{"Name":"Drama","Description":"A category of narrative fiction or semi-fiction intended to be more serious than humorous in tone."},"Director":{"Name":"Nick Cassavetes","Bio":"Nicholas David Rowland Cassavetes is an American actor, director, and writer.","Birth":"1959"},"ImagePath":"thenotebook.png","Featured":false}
{"_id":{"$oid":"63f4026572ba79dbfad593ca"},"Title":"The Godfather","Descirption":"Don Vito Corleone, head of a mafia family, decides to hand over his empire to his youngest son Michael. However, his decision unintentionally puts the lives of his loved ones in grave danger.","Genre":{"Name":"Drama","Description":"A category of narrative fiction or semi-fiction intended to be more serious than humorous in tone."},"Director":{"Name":"Francis Ford Coppola","Bio":"He helped to make a star of his nephew, Nicolas Cage. Personal tragedy hit in 1986 when his son Gio died in a boating accident. Francis Ford Coppola is one of America's most erratic, energetic and controversial filmmakers.","Birth":"1944"},"ImagePath":"thegodfather.png","Featured":false}
{"_id":{"$oid":"63f4026c72ba79dbfad593cb"},"Title":"Avatar","Description":"Jake, who is paraplegic, replaces his twin on the Na'vi inhabited Pandora for a corporate mission. After the natives accept him as one of their own, he must decide where his loyalties lie.","Genre":{"Name":"Action","Description":"A film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"James Cameron","Bio":"James Cameron is now one of the most sought-after directors in Hollywood. He was formerly married to producer Gale Anne Hurd, who produced several of his films.","Birth":"1944"},"ImagePath":"avatar.png","Featured":false,"Bio":"Cameron co-founded the production companies Lightstorm Entertainment, Digital Domain, and Earthship Productions."}
{"_id":{"$oid":"63f403c372ba79dbfad593cc"},"Title":"Terminator 2","Description":"A terminator is sent on a mission to kill Sarah's son, John Connor. However, another cyborg, who was once after Sarah's life, has now been assigned to protect him","Genre":{"Name":"Action","Description":"A film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"James Cameron","Bio":"James Cameron is now one of the most sought-after directors in Hollywood. He was formerly married to producer Gale Anne Hurd, who produced several of his films.","Birth":"1944"},"ImagePath":"terminator2.png","Featured":false,"Bio":"Cameron co-founded the production companies Lightstorm Entertainment, Digital Domain, and Earthship Productions."}
{"_id":{"$oid":"63f404a972ba79dbfad593cd"},"Title":"A Nightmare on Elm Street","Description":"A young girl realises that she has to stay awake at any cost to avoid the clawed killer who is butchering her friends one by one in their dreams.","Genre":{"Name":"Horror","Description":"Horror films often explore dark subject matter and may deal with transgressive topics or themes."},"Director":{"Name":"Wes Craven","Bio":"Wes Craven has become synonymous with genre bending and innovative horror, challenging audiences with his bold vision.","Birth":"1944","Death":"2015"},"ImagePath":"anightmareonelmstreet.png","Featured":false}
{"_id":{"$oid":"63f4059872ba79dbfad593ce"},"Title":"Nope","Description":"A man and his sister discover something sinister in the skies above their California horse ranch, while the owner of a nearby theme park tries to profit from the mysterious, otherworldly phenomenon.","Genre":{"Name":"Horror","Description":"Horror films often explore dark subject matter and may deal with transgressive topics or themes."},"Director":{"Name":"Jordan Poole","Bio":"Jordan Poole is an Oscar- and Emmy-winning director, writer, actor, producer, and founder of Monkeypaw Productions.","Birth":"1979"},"ImagePath":"Nope","Featured":false}
{"_id":{"$oid":"63f4073372ba79dbfad593cf"},"Title":"Elf","Description":"Buddy, a human, is raised amongst elves at the North Pole. When he discovers that he is not an elf, he travels to New York to search for his biological father.","Genre":{"Name":"Christmas","Description":"A film in which the Christmas holiday, its trappings, and themes are integral to the telling of the story."},"Director":{"Name":"John Favreau","Bio":"Initially an indie film favorite, actor Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director.","Birth":"1966"},"ImagePath":"elf.png","Featured":false}
{"_id":{"$oid":"63f4096c72ba79dbfad593d1"},"Title":"Die Hard","Description":"Hoping to spend Christmas with his estranged wife, detective John McClane arrives in LA. However, he learns about a hostage situation in an office building and his wife is one of the hostages.","Genre":{"Name":"Christmas","Description":"A film in which the Christmas holiday, its trappings, and themes are integral to the telling of the story."},"Director":{"Name":"John McTiernan","Bio":"An American filmmaker best known for his action films, especially Predator, Die Hard, and The Hunt for Red October.","Birth":"1951"},"ImagePath":"diehard.png","Featured":false}
